In [1]:
import pandas as pd

data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [2]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [3]:
department

   id   name
0   1     IT
1   2  Sales

查找出每个部门中薪资最高的员工。
按 **任意顺序** 返回结果表。

In [4]:
df = employee.merge(department, left_on='departmentId', right_on='id', how='left')
df

   id_x name_x  salary  departmentId  id_y name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     3  Henry   80000             2     2  Sales
3     4    Sam   60000             2     2  Sales
4     5    Max   90000             1     1     IT

In [5]:
df.rename(columns={'name_x': 'Employee', 'name_y': 'Department', 'salary': 'Salary'}, inplace=True)
df

   id_x Employee  Salary  departmentId  id_y Department
0     1      Joe   70000             1     1         IT
1     2      Jim   90000             1     1         IT
2     3    Henry   80000             2     2      Sales
3     4      Sam   60000             2     2      Sales
4     5      Max   90000             1     1         IT

In [6]:
for k,v in df.groupby('Department'):
    print(k)
    print(v)

IT
   id_x Employee  Salary  departmentId  id_y Department
0     1      Joe   70000             1     1         IT
1     2      Jim   90000             1     1         IT
4     5      Max   90000             1     1         IT
Sales
   id_x Employee  Salary  departmentId  id_y Department
2     3    Henry   80000             2     2      Sales
3     4      Sam   60000             2     2      Sales

In [7]:
for k,v in df.groupby('Department')['Salary']:
    print(k)
    print(v)

IT
0    70000
1    90000
4    90000
Name: Salary, dtype: Int64
Sales
2    80000
3    60000
Name: Salary, dtype: Int64

In [8]:
df.groupby('Department')['Salary'].transform('max')

0    90000
1    90000
2    80000
3    80000
4    90000
Name: Salary, dtype: Int64

`max_salary = df.groupby('Department')['Salary'].transform('max')` 的作用是找出每个部门的最高工资。

首先，`df.groupby('Department')` 会将数据按照 'Department' 列进行分组，也就是将相同部门的员工数据聚合在一起。

然后，`['Salary'].transform('max')` 会对每个部门的 'Salary' 列应用 'max' 函数，也就是找出每个部门的最高工资。

最后，`max_salary` 是一个新的 DataFrame，其行数与原始的 `df` DataFrame 相同，但每行的值都是对应部门的最高工资。这意味着，如果一个员工的工资等于他们所在部门的最高工资，那么他们在 `max_salary` DataFrame 中的值将等于他们的工资。

In [9]:
max_salary = df.groupby('Department')['Salary'].transform('max')
max_salary

0    90000
1    90000
2    80000
3    80000
4    90000
Name: Salary, dtype: Int64

In [10]:
df = df[df['Salary'] == max_salary]
df

   id_x Employee  Salary  departmentId  id_y Department
1     2      Jim   90000             1     1         IT
2     3    Henry   80000             2     2      Sales
4     5      Max   90000             1     1         IT

In [11]:
df[['Department', 'Employee', 'Salary']]

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000